{"data":{"markdownRemark":{"html":"<p>For your first exercise you are going to build a quiz game! We are going to use a tool called <a href=\"https://codepen.io\">CodePen</a>. CodePen is basically a little miniature development environment contained in your browser. Instead of having your separate HTML, CSS, and JavaScript files, CodePen combines them nicely into one web page for you. It's nice for making simple, shareable pieces of code. And you it makes it easy to do exercises.</p>\n<p>Some words of advice for as you use CodePen:</p>\n<ul>\n<li>I recommend signing up for an account. But you do not have to. This will allow you to save your work.</li>\n<li>The way you'll be able to save your work is click the <strong>Fork</strong> button. It means to fork (as in how a river forks) from the original author's version to your own version. You can modify it without worrying about changing mine. It's making your own copy.</li>\n<li>It is possible to crash the browser. Normally CodePen can recover well on its own but in the case that you make it crash so bad it can't even start, see this <a href=\"https://blog.codepen.io/documentation/features/turn-off-javascript-in-previews/\">blog post</a> to see how to start with JavaScript turned off.</li>\n<li>In this exercise you do not need to modify the CSS or HTML at all. However you can see it and play around it if you want to.</li>\n<li>The first one is complete for you as an example. You don't need to change anything about it.</li>\n<li>If you see see a icon like this: <span style=\"border-radius: 50%; width: 15px; height: 15px; line-height: 15px; display: inline-block; text-align: center; background: red; color: white;\">!</span> in the bottom right of the JavaScript pane, it means you have syntax errors in your JS (code that doesn't work / make sense.) If you click on it, it will show you what's wrong. If you're writing code and nothing is happening differently, check to see if that exclamation point is there.</li>\n<li>If you're stuck, Google it. That's not cheating. That's what you're supposed to do.</li>\n<li>Don't be afraid of looking at the answers. This is about learning, not grades. That said, don't cheat yourself. Try. Struggle. Learn.</li>\n</ul>\n<p>Good luck!</p>\n<ul>\n<li><a href=\"https://codepen.io/btholt/pen/VELvwP\">Exercise</a></li>\n<li><a href=\"https://codepen.io/btholt/pen/aRZWGV\">Answer</a></li>\n</ul>","frontmatter":{"path":"/quiz","title":"Exercise: Quiz","order":3}},"allMarkdownRemark":{"edges":[{"node":{"frontmatter":{"order":0,"path":"/intro","title":"Introduction to the Course"}}},{"node":{"frontmatter":{"order":1,"path":"/programming-fundamentals","title":"Programming Fundamentals"}}},{"node":{"frontmatter":{"order":2,"path":"/functions-and-scope","title":"Functions and Scope"}}},{"node":{"frontmatter":{"order":3,"path":"/quiz","title":"Exercise: Quiz"}}},{"node":{"frontmatter":{"order":4,"path":"/objects-and-arrays","title":"Objects and Arrays"}}}]}},"pageContext":{}}